{
  "metadata": {
    "total_size": 632989704192
  },
  "weight_map": {
    "model.embed_tokens.weight": "pytorch_model-00000.bin",
    "lm_head.weight": "pytorch_model-00000.bin",
    "model.norm.scale": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.0.linear.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.1.linear.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.2.linear.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.3.linear.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.4.linear.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.5.linear.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.6.linear.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.7.linear.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.0.linear_1.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.1.linear_1.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.2.linear_1.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.3.linear_1.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.4.linear_1.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.5.linear_1.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.6.linear_1.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.7.linear_1.weight": "pytorch_model-00000.bin",
    "model.layers.0.moe_block.experts.0.linear_v.weight": "pytorch_model-00001.bin",
    "model.layers.0.moe_block.experts.1.linear_v.weight": "pytorch_model-00001.bin",
    "model.layers.0.moe_block.experts.2.linear_v.weight": "pytorch_model-00001.bin",
    "model.layers.0.moe_block.experts.3.linear_v.weight": "pytorch_model-00001.bin",
    "model.layers.0.moe_block.experts.4.linear_v.weight": "pytorch_model-00001.bin",
    "model.layers.0.moe_block.experts.5.linear_v.weight": "pytorch_model-00001.bin",
    "model.layers.0.moe_block.experts.6.linear_v.weight": "pytorch_model-00001.bin",
    "model.layers.0.moe_block.experts.7.linear_v.weight": "pytorch_model-00001.bin",
    "model.layers.0.attn.k_proj.weight": "pytorch_model-00001.bin",
    "model.layers.0.attn.o_proj.weight": "pytorch_model-00001.bin",
    "model.layers.0.attn.q_proj.weight": "pytorch_model-00001.bin",
    "model.layers.0.attn.v_proj.weight": "pytorch_model-00001.bin",
    "model.layers.0.pre_attn_norm.scale": "pytorch_model-00001.bin",
    "model.layers.0.post_attn_norm.scale": "pytorch_model-00001.bin",
    "model.layers.0.pre_moe_norm.scale": "pytorch_model-00001.bin",
    "model.layers.0.post_moe_norm.scale": "pytorch_model-00001.bin",
    "model.layers.0.moe_block.gate.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.0.linear.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.1.linear.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.2.linear.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.3.linear.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.4.linear.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.5.linear.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.6.linear.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.7.linear.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.0.linear_1.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.1.linear_1.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.2.linear_1.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.3.linear_1.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.4.linear_1.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.5.linear_1.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.6.linear_1.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.7.linear_1.weight": "pytorch_model-00001.bin",
    "model.layers.1.moe_block.experts.0.linear_v.weight": "pytorch_model-00002.bin",
    "model.layers.1.moe_block.experts.1.linear_v.weight": "pytorch_model-00002.bin",
    "model.layers.1.moe_block.experts.2.linear_v.weight": "pytorch_model-00002.bin",
    "model.layers.1.moe_block.experts.3.linear_v.weight": "pytorch_model-00002.bin",
    "model.layers.1.moe_block.experts.4.linear_v.weight": "pytorch_model-00002.bin",
    "model.layers.1.moe_block.experts.5.linear_v.weight": "pytorch_model-00002.bin",
    "model.layers.1.moe_block.experts.6.linear_v.weight": "pytorch_model-00002.bin",
    "model.layers.1.moe_block.experts.7.linear_v.weight": "pytorch_model-00002.bin",
    "model.layers.1.attn.k_proj.weight": "pytorch_model-00002.bin",
    "model.layers.1.attn.o_proj.weight": "pytorch_model-00002.bin",
    "model.layers.1.attn.q_proj.weight": "pytorch_model-00002.bin",
    "model.layers.1.attn.v_proj.weight": "pytorch_model-00002.bin",
    "model.layers.1.pre_attn_norm.scale": "pytorch_model-00002.bin",
    "model.layers.1.post_attn_norm.scale": "pytorch_model-00002.bin",
    "model.layers.1.pre_moe_norm.scale": "pytorch_model-00002.bin",
    "model.layers.1.post_moe_norm.scale": "pytorch_model-00002.bin",
    "model.layers.1.moe_block.gate.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.0.linear.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.1.linear.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.2.linear.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.3.linear.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.4.linear.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.5.linear.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.6.linear.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.7.linear.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.0.linear_1.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.1.linear_1.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.2.linear_1.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.3.linear_1.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.4.linear_1.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.5.linear_1.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.6.linear_1.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.7.linear_1.weight": "pytorch_model-00002.bin",
    "model.layers.10.moe_block.experts.0.linear_v.weight": "pytorch_model-00003.bin",
    "model.layers.10.moe_block.experts.1.linear_v.weight": "pytorch_model-00003.bin",
    "model.layers.10.moe_block.experts.2.linear_v.weight": "pytorch_model-00003.bin",
    "model.layers.10.moe_block.experts.3.linear_v.weight": "pytorch_model-00003.bin",
    "model.layers.10.moe_block.experts.4.linear_v.weight": "pytorch_model-00003.bin",
    "model.layers.10.moe_block.experts.5.linear_v.weight": "pytorch_model-00003.bin",
    "model.layers.10.moe_block.experts.6.linear_v.weight": "pytorch_model-00003.bin",
    "model.layers.10.moe_block.experts.7.linear_v.weight": "pytorch_model-00003.bin",
    "model.layers.10.attn.k_proj.weight": "pytorch_model-00003.bin",
    "model.layers.10.attn.o_proj.weight": "pytorch_model-00003.bin",
    "model.layers.10.attn.q_proj.weight": "pytorch_model-00003.bin",
    "model.layers.10.attn.v_proj.weight": "pytorch_model-00003.bin",
    "model.layers.10.pre_attn_norm.scale": "pytorch_model-00003.bin",
    "model.layers.10.post_attn_norm.scale": "pytorch_model-00003.bin",
    "model.layers.10.pre_moe_norm.scale": "pytorch_model-00003.bin",
    "model.layers.10.post_moe_norm.scale": "pytorch_model-00003.bin",
    "model.layers.10.moe_block.gate.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.0.linear.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.1.linear.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.2.linear.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.3.linear.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.4.linear.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.5.linear.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.6.linear.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.7.linear.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.0.linear_1.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.1.linear_1.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.2.linear_1.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.3.linear_1.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.4.linear_1.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.5.linear_1.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.6.linear_1.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.7.linear_1.weight": "pytorch_model-00003.bin",
    "model.layers.11.moe_block.experts.0.linear_v.weight": "pytorch_model-00004.bin",
    "model.layers.11.moe_block.experts.1.linear_v.weight": "pytorch_model-00004.bin",
    "model.layers.11.moe_block.experts.2.linear_v.weight": "pytorch_model-00004.bin",
    "model.layers.11.moe_block.experts.3.linear_v.weight": "pytorch_model-00004.bin",
    "model.layers.11.moe_block.experts.4.linear_v.weight": "pytorch_model-00004.bin",
    "model.layers.11.moe_block.experts.5.linear_v.weight": "pytorch_model-00004.bin",
    "model.layers.11.moe_block.experts.6.linear_v.weight": "pytorch_model-00004.bin",
    "model.layers.11.moe_block.experts.7.linear_v.weight": "pytorch_model-00004.bin",
    "model.layers.11.attn.k_proj.weight": "pytorch_model-00004.bin",
    "model.layers.11.attn.o_proj.weight": "pytorch_model-00004.bin",
    "model.layers.11.attn.q_proj.weight": "pytorch_model-00004.bin",
    "model.layers.11.attn.v_proj.weight": "pytorch_model-00004.bin",
    "model.layers.11.pre_attn_norm.scale": "pytorch_model-00004.bin",
    "model.layers.11.post_attn_norm.scale": "pytorch_model-00004.bin",
    "model.layers.11.pre_moe_norm.scale": "pytorch_model-00004.bin",
    "model.layers.11.post_moe_norm.scale": "pytorch_model-00004.bin",
    "model.layers.11.moe_block.gate.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.0.linear.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.1.linear.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.2.linear.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.3.linear.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.4.linear.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.5.linear.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.6.linear.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.7.linear.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.0.linear_1.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.1.linear_1.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.2.linear_1.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.3.linear_1.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.4.linear_1.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.5.linear_1.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.6.linear_1.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.7.linear_1.weight": "pytorch_model-00004.bin",
    "model.layers.12.moe_block.experts.0.linear_v.weight": "pytorch_model-00005.bin",
    "model.layers.12.moe_block.experts.1.linear_v.weight": "pytorch_model-00005.bin",
    "model.layers.12.moe_block.experts.2.linear_v.weight": "pytorch_model-00005.bin",
    "model.layers.12.moe_block.experts.3.linear_v.weight": "pytorch_model-00005.bin",
    "model.layers.12.moe_block.experts.4.linear_v.weight": "pytorch_model-00005.bin",
    "model.layers.12.moe_block.experts.5.linear_v.weight": "pytorch_model-00005.bin",
    "model.layers.12.moe_block.experts.6.linear_v.weight": "pytorch_model-00005.bin",
    "model.layers.12.moe_block.experts.7.linear_v.weight": "pytorch_model-00005.bin",
    "model.layers.12.attn.k_proj.weight": "pytorch_model-00005.bin",
    "model.layers.12.attn.o_proj.weight": "pytorch_model-00005.bin",
    "model.layers.12.attn.q_proj.weight": "pytorch_model-00005.bin",
    "model.layers.12.attn.v_proj.weight": "pytorch_model-00005.bin",
    "model.layers.12.pre_attn_norm.scale": "pytorch_model-00005.bin",
    "model.layers.12.post_attn_norm.scale": "pytorch_model-00005.bin",
    "model.layers.12.pre_moe_norm.scale": "pytorch_model-00005.bin",
    "model.layers.12.post_moe_norm.scale": "pytorch_model-00005.bin",
    "model.layers.12.moe_block.gate.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.0.linear.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.1.linear.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.2.linear.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.3.linear.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.4.linear.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.5.linear.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.6.linear.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.7.linear.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.0.linear_1.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.1.linear_1.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.2.linear_1.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.3.linear_1.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.4.linear_1.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.5.linear_1.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.6.linear_1.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.7.linear_1.weight": "pytorch_model-00005.bin",
    "model.layers.13.moe_block.experts.0.linear_v.weight": "pytorch_model-00006.bin",
    "model.layers.13.moe_block.experts.1.linear_v.weight": "pytorch_model-00006.bin",
    "model.layers.13.moe_block.experts.2.linear_v.weight": "pytorch_model-00006.bin",
    "model.layers.13.moe_block.experts.3.linear_v.weight": "pytorch_model-00006.bin",
    "model.layers.13.moe_block.experts.4.linear_v.weight": "pytorch_model-00006.bin",
    "model.layers.13.moe_block.experts.5.linear_v.weight": "pytorch_model-00006.bin",
    "model.layers.13.moe_block.experts.6.linear_v.weight": "pytorch_model-00006.bin",
    "model.layers.13.moe_block.experts.7.linear_v.weight": "pytorch_model-00006.bin",
    "model.layers.13.attn.k_proj.weight": "pytorch_model-00006.bin",
    "model.layers.13.attn.o_proj.weight": "pytorch_model-00006.bin",
    "model.layers.13.attn.q_proj.weight": "pytorch_model-00006.bin",
    "model.layers.13.attn.v_proj.weight": "pytorch_model-00006.bin",
    "model.layers.13.pre_attn_norm.scale": "pytorch_model-00006.bin",
    "model.layers.13.post_attn_norm.scale": "pytorch_model-00006.bin",
    "model.layers.13.pre_moe_norm.scale": "pytorch_model-00006.bin",
    "model.layers.13.post_moe_norm.scale": "pytorch_model-00006.bin",
    "model.layers.13.moe_block.gate.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.0.linear.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.1.linear.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.2.linear.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.3.linear.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.4.linear.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.5.linear.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.6.linear.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.7.linear.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.0.linear_1.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.1.linear_1.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.2.linear_1.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.3.linear_1.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.4.linear_1.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.5.linear_1.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.6.linear_1.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.7.linear_1.weight": "pytorch_model-00006.bin",
    "model.layers.14.moe_block.experts.0.linear_v.weight": "pytorch_model-00007.bin",
    "model.layers.14.moe_block.experts.1.linear_v.weight": "pytorch_model-00007.bin",
    "model.layers.14.moe_block.experts.2.linear_v.weight": "pytorch_model-00007.bin",
    "model.layers.14.moe_block.experts.3.linear_v.weight": "pytorch_model-00007.bin",
    "model.layers.14.moe_block.experts.4.linear_v.weight": "pytorch_model-00007.bin",
    "model.layers.14.moe_block.experts.5.linear_v.weight": "pytorch_model-00007.bin",
    "model.layers.14.moe_block.experts.6.linear_v.weight": "pytorch_model-00007.bin",
    "model.layers.14.moe_block.experts.7.linear_v.weight": "pytorch_model-00007.bin",
    "model.layers.14.attn.k_proj.weight": "pytorch_model-00007.bin",
    "model.layers.14.attn.o_proj.weight": "pytorch_model-00007.bin",
    "model.layers.14.attn.q_proj.weight": "pytorch_model-00007.bin",
    "model.layers.14.attn.v_proj.weight": "pytorch_model-00007.bin",
    "model.layers.14.pre_attn_norm.scale": "pytorch_model-00007.bin",
    "model.layers.14.post_attn_norm.scale": "pytorch_model-00007.bin",
    "model.layers.14.pre_moe_norm.scale": "pytorch_model-00007.bin",
    "model.layers.14.post_moe_norm.scale": "pytorch_model-00007.bin",
    "model.layers.14.moe_block.gate.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.0.linear.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.1.linear.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.2.linear.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.3.linear.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.4.linear.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.5.linear.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.6.linear.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.7.linear.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.0.linear_1.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.1.linear_1.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.2.linear_1.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.3.linear_1.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.4.linear_1.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.5.linear_1.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.6.linear_1.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.7.linear_1.weight": "pytorch_model-00007.bin",
    "model.layers.15.moe_block.experts.0.linear_v.weight": "pytorch_model-00008.bin",
    "model.layers.15.moe_block.experts.1.linear_v.weight": "pytorch_model-00008.bin",
    "model.layers.15.moe_block.experts.2.linear_v.weight": "pytorch_model-00008.bin",
    "model.layers.15.moe_block.experts.3.linear_v.weight": "pytorch_model-00008.bin",
    "model.layers.15.moe_block.experts.4.linear_v.weight": "pytorch_model-00008.bin",
    "model.layers.15.moe_block.experts.5.linear_v.weight": "pytorch_model-00008.bin",
    "model.layers.15.moe_block.experts.6.linear_v.weight": "pytorch_model-00008.bin",
    "model.layers.15.moe_block.experts.7.linear_v.weight": "pytorch_model-00008.bin",
    "model.layers.15.attn.k_proj.weight": "pytorch_model-00008.bin",
    "model.layers.15.attn.o_proj.weight": "pytorch_model-00008.bin",
    "model.layers.15.attn.q_proj.weight": "pytorch_model-00008.bin",
    "model.layers.15.attn.v_proj.weight": "pytorch_model-00008.bin",
    "model.layers.15.pre_attn_norm.scale": "pytorch_model-00008.bin",
    "model.layers.15.post_attn_norm.scale": "pytorch_model-00008.bin",
    "model.layers.15.pre_moe_norm.scale": "pytorch_model-00008.bin",
    "model.layers.15.post_moe_norm.scale": "pytorch_model-00008.bin",
    "model.layers.15.moe_block.gate.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.0.linear.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.1.linear.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.2.linear.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.3.linear.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.4.linear.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.5.linear.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.6.linear.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.7.linear.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.0.linear_1.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.1.linear_1.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.2.linear_1.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.3.linear_1.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.4.linear_1.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.5.linear_1.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.6.linear_1.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.7.linear_1.weight": "pytorch_model-00008.bin",
    "model.layers.16.moe_block.experts.0.linear_v.weight": "pytorch_model-00009.bin",
    "model.layers.16.moe_block.experts.1.linear_v.weight": "pytorch_model-00009.bin",
    "model.layers.16.moe_block.experts.2.linear_v.weight": "pytorch_model-00009.bin",
    "model.layers.16.moe_block.experts.3.linear_v.weight": "pytorch_model-00009.bin",
    "model.layers.16.moe_block.experts.4.linear_v.weight": "pytorch_model-00009.bin",
    "model.layers.16.moe_block.experts.5.linear_v.weight": "pytorch_model-00009.bin",
    "model.layers.16.moe_block.experts.6.linear_v.weight": "pytorch_model-00009.bin",
    "model.layers.16.moe_block.experts.7.linear_v.weight": "pytorch_model-00009.bin",
    "model.layers.16.attn.k_proj.weight": "pytorch_model-00009.bin",
    "model.layers.16.attn.o_proj.weight": "pytorch_model-00009.bin",
    "model.layers.16.attn.q_proj.weight": "pytorch_model-00009.bin",
    "model.layers.16.attn.v_proj.weight": "pytorch_model-00009.bin",
    "model.layers.16.pre_attn_norm.scale": "pytorch_model-00009.bin",
    "model.layers.16.post_attn_norm.scale": "pytorch_model-00009.bin",
    "model.layers.16.pre_moe_norm.scale": "pytorch_model-00009.bin",
    "model.layers.16.post_moe_norm.scale": "pytorch_model-00009.bin",
    "model.layers.16.moe_block.gate.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.0.linear.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.1.linear.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.2.linear.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.3.linear.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.4.linear.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.5.linear.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.6.linear.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.7.linear.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.0.linear_1.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.1.linear_1.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.2.linear_1.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.3.linear_1.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.4.linear_1.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.5.linear_1.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.6.linear_1.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.7.linear_1.weight": "pytorch_model-00009.bin",
    "model.layers.17.moe_block.experts.0.linear_v.weight": "pytorch_model-00010.bin",
    "model.layers.17.moe_block.experts.1.linear_v.weight": "pytorch_model-00010.bin",
    "model.layers.17.moe_block.experts.2.linear_v.weight": "pytorch_model-00010.bin",
    "model.layers.17.moe_block.experts.3.linear_v.weight": "pytorch_model-00010.bin",
    "model.layers.17.moe_block.experts.4.linear_v.weight": "pytorch_model-00010.bin",
    "model.layers.17.moe_block.experts.5.linear_v.weight": "pytorch_model-00010.bin",
    "model.layers.17.moe_block.experts.6.linear_v.weight": "pytorch_model-00010.bin",
    "model.layers.17.moe_block.experts.7.linear_v.weight": "pytorch_model-00010.bin",
    "model.layers.17.attn.k_proj.weight": "pytorch_model-00010.bin",
    "model.layers.17.attn.o_proj.weight": "pytorch_model-00010.bin",
    "model.layers.17.attn.q_proj.weight": "pytorch_model-00010.bin",
    "model.layers.17.attn.v_proj.weight": "pytorch_model-00010.bin",
    "model.layers.17.pre_attn_norm.scale": "pytorch_model-00010.bin",
    "model.layers.17.post_attn_norm.scale": "pytorch_model-00010.bin",
    "model.layers.17.pre_moe_norm.scale": "pytorch_model-00010.bin",
    "model.layers.17.post_moe_norm.scale": "pytorch_model-00010.bin",
    "model.layers.17.moe_block.gate.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.0.linear.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.1.linear.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.2.linear.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.3.linear.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.4.linear.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.5.linear.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.6.linear.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.7.linear.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.0.linear_1.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.1.linear_1.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.2.linear_1.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.3.linear_1.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.4.linear_1.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.5.linear_1.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.6.linear_1.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.7.linear_1.weight": "pytorch_model-00010.bin",
    "model.layers.18.moe_block.experts.0.linear_v.weight": "pytorch_model-00011.bin",
    "model.layers.18.moe_block.experts.1.linear_v.weight": "pytorch_model-00011.bin",
    "model.layers.18.moe_block.experts.2.linear_v.weight": "pytorch_model-00011.bin",
    "model.layers.18.moe_block.experts.3.linear_v.weight": "pytorch_model-00011.bin",
    "model.layers.18.moe_block.experts.4.linear_v.weight": "pytorch_model-00011.bin",
    "model.layers.18.moe_block.experts.5.linear_v.weight": "pytorch_model-00011.bin",
    "model.layers.18.moe_block.experts.6.linear_v.weight": "pytorch_model-00011.bin",
    "model.layers.18.moe_block.experts.7.linear_v.weight": "pytorch_model-00011.bin",
    "model.layers.18.attn.k_proj.weight": "pytorch_model-00011.bin",
    "model.layers.18.attn.o_proj.weight": "pytorch_model-00011.bin",
    "model.layers.18.attn.q_proj.weight": "pytorch_model-00011.bin",
    "model.layers.18.attn.v_proj.weight": "pytorch_model-00011.bin",
    "model.layers.18.pre_attn_norm.scale": "pytorch_model-00011.bin",
    "model.layers.18.post_attn_norm.scale": "pytorch_model-00011.bin",
    "model.layers.18.pre_moe_norm.scale": "pytorch_model-00011.bin",
    "model.layers.18.post_moe_norm.scale": "pytorch_model-00011.bin",
    "model.layers.18.moe_block.gate.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.0.linear.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.1.linear.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.2.linear.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.3.linear.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.4.linear.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.5.linear.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.6.linear.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.7.linear.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.0.linear_1.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.1.linear_1.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.2.linear_1.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.3.linear_1.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.4.linear_1.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.5.linear_1.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.6.linear_1.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.7.linear_1.weight": "pytorch_model-00011.bin",
    "model.layers.19.moe_block.experts.0.linear_v.weight": "pytorch_model-00012.bin",
    "model.layers.19.moe_block.experts.1.linear_v.weight": "pytorch_model-00012.bin",
    "model.layers.19.moe_block.experts.2.linear_v.weight": "pytorch_model-00012.bin",
    "model.layers.19.moe_block.experts.3.linear_v.weight": "pytorch_model-00012.bin",
    "model.layers.19.moe_block.experts.4.linear_v.weight": "pytorch_model-00012.bin",
    "model.layers.19.moe_block.experts.5.linear_v.weight": "pytorch_model-00012.bin",
    "model.layers.19.moe_block.experts.6.linear_v.weight": "pytorch_model-00012.bin",
    "model.layers.19.moe_block.experts.7.linear_v.weight": "pytorch_model-00012.bin",
    "model.layers.19.attn.k_proj.weight": "pytorch_model-00012.bin",
    "model.layers.19.attn.o_proj.weight": "pytorch_model-00012.bin",
    "model.layers.19.attn.q_proj.weight": "pytorch_model-00012.bin",
    "model.layers.19.attn.v_proj.weight": "pytorch_model-00012.bin",
    "model.layers.19.pre_attn_norm.scale": "pytorch_model-00012.bin",
    "model.layers.19.post_attn_norm.scale": "pytorch_model-00012.bin",
    "model.layers.19.pre_moe_norm.scale": "pytorch_model-00012.bin",
    "model.layers.19.post_moe_norm.scale": "pytorch_model-00012.bin",
    "model.layers.19.moe_block.gate.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.0.linear.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.1.linear.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.2.linear.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.3.linear.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.4.linear.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.5.linear.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.6.linear.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.7.linear.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.0.linear_1.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.1.linear_1.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.2.linear_1.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.3.linear_1.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.4.linear_1.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.5.linear_1.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.6.linear_1.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.7.linear_1.weight": "pytorch_model-00012.bin",
    "model.layers.2.moe_block.experts.0.linear_v.weight": "pytorch_model-00013.bin",
    "model.layers.2.moe_block.experts.1.linear_v.weight": "pytorch_model-00013.bin",
    "model.layers.2.moe_block.experts.2.linear_v.weight": "pytorch_model-00013.bin",
    "model.layers.2.moe_block.experts.3.linear_v.weight": "pytorch_model-00013.bin",
    "model.layers.2.moe_block.experts.4.linear_v.weight": "pytorch_model-00013.bin",
    "model.layers.2.moe_block.experts.5.linear_v.weight": "pytorch_model-00013.bin",
    "model.layers.2.moe_block.experts.6.linear_v.weight": "pytorch_model-00013.bin",
    "model.layers.2.moe_block.experts.7.linear_v.weight": "pytorch_model-00013.bin",
    "model.layers.2.attn.k_proj.weight": "pytorch_model-00013.bin",
    "model.layers.2.attn.o_proj.weight": "pytorch_model-00013.bin",
    "model.layers.2.attn.q_proj.weight": "pytorch_model-00013.bin",
    "model.layers.2.attn.v_proj.weight": "pytorch_model-00013.bin",
    "model.layers.2.pre_attn_norm.scale": "pytorch_model-00013.bin",
    "model.layers.2.post_attn_norm.scale": "pytorch_model-00013.bin",
    "model.layers.2.pre_moe_norm.scale": "pytorch_model-00013.bin",
    "model.layers.2.post_moe_norm.scale": "pytorch_model-00013.bin",
    "model.layers.2.moe_block.gate.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.0.linear.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.1.linear.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.2.linear.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.3.linear.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.4.linear.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.5.linear.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.6.linear.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.7.linear.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.0.linear_1.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.1.linear_1.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.2.linear_1.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.3.linear_1.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.4.linear_1.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.5.linear_1.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.6.linear_1.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.7.linear_1.weight": "pytorch_model-00013.bin",
    "model.layers.20.moe_block.experts.0.linear_v.weight": "pytorch_model-00014.bin",
    "model.layers.20.moe_block.experts.1.linear_v.weight": "pytorch_model-00014.bin",
    "model.layers.20.moe_block.experts.2.linear_v.weight": "pytorch_model-00014.bin",
    "model.layers.20.moe_block.experts.3.linear_v.weight": "pytorch_model-00014.bin",
    "model.layers.20.moe_block.experts.4.linear_v.weight": "pytorch_model-00014.bin",
    "model.layers.20.moe_block.experts.5.linear_v.weight": "pytorch_model-00014.bin",
    "model.layers.20.moe_block.experts.6.linear_v.weight": "pytorch_model-00014.bin",
    "model.layers.20.moe_block.experts.7.linear_v.weight": "pytorch_model-00014.bin",
    "model.layers.20.attn.k_proj.weight": "pytorch_model-00014.bin",
    "model.layers.20.attn.o_proj.weight": "pytorch_model-00014.bin",
    "model.layers.20.attn.q_proj.weight": "pytorch_model-00014.bin",
    "model.layers.20.attn.v_proj.weight": "pytorch_model-00014.bin",
    "model.layers.20.pre_attn_norm.scale": "pytorch_model-00014.bin",
    "model.layers.20.post_attn_norm.scale": "pytorch_model-00014.bin",
    "model.layers.20.pre_moe_norm.scale": "pytorch_model-00014.bin",
    "model.layers.20.post_moe_norm.scale": "pytorch_model-00014.bin",
    "model.layers.20.moe_block.gate.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.0.linear.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.1.linear.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.2.linear.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.3.linear.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.4.linear.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.5.linear.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.6.linear.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.7.linear.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.0.linear_1.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.1.linear_1.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.2.linear_1.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.3.linear_1.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.4.linear_1.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.5.linear_1.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.6.linear_1.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.7.linear_1.weight": "pytorch_model-00014.bin",
    "model.layers.21.moe_block.experts.0.linear_v.weight": "pytorch_model-00015.bin",
    "model.layers.21.moe_block.experts.1.linear_v.weight": "pytorch_model-00015.bin",
    "model.layers.21.moe_block.experts.2.linear_v.weight": "pytorch_model-00015.bin",
    "model.layers.21.moe_block.experts.3.linear_v.weight": "pytorch_model-00015.bin",
    "model.layers.21.moe_block.experts.4.linear_v.weight": "pytorch_model-00015.bin",
    "model.layers.21.moe_block.experts.5.linear_v.weight": "pytorch_model-00015.bin",
    "model.layers.21.moe_block.experts.6.linear_v.weight": "pytorch_model-00015.bin",
    "model.layers.21.moe_block.experts.7.linear_v.weight": "pytorch_model-00015.bin",
    "model.layers.21.attn.k_proj.weight": "pytorch_model-00015.bin",
    "model.layers.21.attn.o_proj.weight": "pytorch_model-00015.bin",
    "model.layers.21.attn.q_proj.weight": "pytorch_model-00015.bin",
    "model.layers.21.attn.v_proj.weight": "pytorch_model-00015.bin",
    "model.layers.21.pre_attn_norm.scale": "pytorch_model-00015.bin",
    "model.layers.21.post_attn_norm.scale": "pytorch_model-00015.bin",
    "model.layers.21.pre_moe_norm.scale": "pytorch_model-00015.bin",
    "model.layers.21.post_moe_norm.scale": "pytorch_model-00015.bin",
    "model.layers.21.moe_block.gate.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.0.linear.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.1.linear.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.2.linear.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.3.linear.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.4.linear.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.5.linear.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.6.linear.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.7.linear.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.0.linear_1.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.1.linear_1.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.2.linear_1.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.3.linear_1.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.4.linear_1.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.5.linear_1.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.6.linear_1.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.7.linear_1.weight": "pytorch_model-00015.bin",
    "model.layers.22.moe_block.experts.0.linear_v.weight": "pytorch_model-00016.bin",
    "model.layers.22.moe_block.experts.1.linear_v.weight": "pytorch_model-00016.bin",
    "model.layers.22.moe_block.experts.2.linear_v.weight": "pytorch_model-00016.bin",
    "model.layers.22.moe_block.experts.3.linear_v.weight": "pytorch_model-00016.bin",
    "model.layers.22.moe_block.experts.4.linear_v.weight": "pytorch_model-00016.bin",
    "model.layers.22.moe_block.experts.5.linear_v.weight": "pytorch_model-00016.bin",
    "model.layers.22.moe_block.experts.6.linear_v.weight": "pytorch_model-00016.bin",
    "model.layers.22.moe_block.experts.7.linear_v.weight": "pytorch_model-00016.bin",
    "model.layers.22.attn.k_proj.weight": "pytorch_model-00016.bin",
    "model.layers.22.attn.o_proj.weight": "pytorch_model-00016.bin",
    "model.layers.22.attn.q_proj.weight": "pytorch_model-00016.bin",
    "model.layers.22.attn.v_proj.weight": "pytorch_model-00016.bin",
    "model.layers.22.pre_attn_norm.scale": "pytorch_model-00016.bin",
    "model.layers.22.post_attn_norm.scale": "pytorch_model-00016.bin",
    "model.layers.22.pre_moe_norm.scale": "pytorch_model-00016.bin",
    "model.layers.22.post_moe_norm.scale": "pytorch_model-00016.bin",
    "model.layers.22.moe_block.gate.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.0.linear.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.1.linear.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.2.linear.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.3.linear.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.4.linear.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.5.linear.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.6.linear.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.7.linear.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.0.linear_1.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.1.linear_1.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.2.linear_1.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.3.linear_1.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.4.linear_1.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.5.linear_1.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.6.linear_1.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.7.linear_1.weight": "pytorch_model-00016.bin",
    "model.layers.23.moe_block.experts.0.linear_v.weight": "pytorch_model-00017.bin",
    "model.layers.23.moe_block.experts.1.linear_v.weight": "pytorch_model-00017.bin",
    "model.layers.23.moe_block.experts.2.linear_v.weight": "pytorch_model-00017.bin",
    "model.layers.23.moe_block.experts.3.linear_v.weight": "pytorch_model-00017.bin",
    "model.layers.23.moe_block.experts.4.linear_v.weight": "pytorch_model-00017.bin",
    "model.layers.23.moe_block.experts.5.linear_v.weight": "pytorch_model-00017.bin",
    "model.layers.23.moe_block.experts.6.linear_v.weight": "pytorch_model-00017.bin",
    "model.layers.23.moe_block.experts.7.linear_v.weight": "pytorch_model-00017.bin",
    "model.layers.23.attn.k_proj.weight": "pytorch_model-00017.bin",
    "model.layers.23.attn.o_proj.weight": "pytorch_model-00017.bin",
    "model.layers.23.attn.q_proj.weight": "pytorch_model-00017.bin",
    "model.layers.23.attn.v_proj.weight": "pytorch_model-00017.bin",
    "model.layers.23.pre_attn_norm.scale": "pytorch_model-00017.bin",
    "model.layers.23.post_attn_norm.scale": "pytorch_model-00017.bin",
    "model.layers.23.pre_moe_norm.scale": "pytorch_model-00017.bin",
    "model.layers.23.post_moe_norm.scale": "pytorch_model-00017.bin",
    "model.layers.23.moe_block.gate.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.0.linear.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.1.linear.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.2.linear.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.3.linear.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.4.linear.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.5.linear.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.6.linear.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.7.linear.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.0.linear_1.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.1.linear_1.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.2.linear_1.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.3.linear_1.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.4.linear_1.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.5.linear_1.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.6.linear_1.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.7.linear_1.weight": "pytorch_model-00017.bin",
    "model.layers.24.moe_block.experts.0.linear_v.weight": "pytorch_model-00018.bin",
    "model.layers.24.moe_block.experts.1.linear_v.weight": "pytorch_model-00018.bin",
    "model.layers.24.moe_block.experts.2.linear_v.weight": "pytorch_model-00018.bin",
    "model.layers.24.moe_block.experts.3.linear_v.weight": "pytorch_model-00018.bin",
    "model.layers.24.moe_block.experts.4.linear_v.weight": "pytorch_model-00018.bin",
    "model.layers.24.moe_block.experts.5.linear_v.weight": "pytorch_model-00018.bin",
    "model.layers.24.moe_block.experts.6.linear_v.weight": "pytorch_model-00018.bin",
    "model.layers.24.moe_block.experts.7.linear_v.weight": "pytorch_model-00018.bin",
    "model.layers.24.attn.k_proj.weight": "pytorch_model-00018.bin",
    "model.layers.24.attn.o_proj.weight": "pytorch_model-00018.bin",
    "model.layers.24.attn.q_proj.weight": "pytorch_model-00018.bin",
    "model.layers.24.attn.v_proj.weight": "pytorch_model-00018.bin",
    "model.layers.24.pre_attn_norm.scale": "pytorch_model-00018.bin",
    "model.layers.24.post_attn_norm.scale": "pytorch_model-00018.bin",
    "model.layers.24.pre_moe_norm.scale": "pytorch_model-00018.bin",
    "model.layers.24.post_moe_norm.scale": "pytorch_model-00018.bin",
    "model.layers.24.moe_block.gate.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.0.linear.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.1.linear.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.2.linear.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.3.linear.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.4.linear.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.5.linear.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.6.linear.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.7.linear.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.0.linear_1.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.1.linear_1.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.2.linear_1.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.3.linear_1.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.4.linear_1.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.5.linear_1.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.6.linear_1.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.7.linear_1.weight": "pytorch_model-00018.bin",
    "model.layers.25.moe_block.experts.0.linear_v.weight": "pytorch_model-00019.bin",
    "model.layers.25.moe_block.experts.1.linear_v.weight": "pytorch_model-00019.bin",
    "model.layers.25.moe_block.experts.2.linear_v.weight": "pytorch_model-00019.bin",
